Core/src/Documents/УчетРабочегоВремениСотрудников/УчетРабочегоВремениСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УчетРабочегоВремениСотрудников</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.УчетРабочегоВремениСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыВремени</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипУчета</name>
      <type>
        <types>EnumRef.ТипыУчетаРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возмещаемый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Приход</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уход</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНевыхода</name>
      <type>
        <types>EnumRef.ПричиныНевыходовНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Documents/УчетРабочегоВремениСотрудников/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Ссылка.Организация КАК Организация,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Сотрудник КАК Сотрудник,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ГрафикРаботы КАК ГрафикРаботы,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ТипУчета КАК ТипУчета,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.КоличествоЧасов КАК КоличествоЧасов,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Возмещаемый КАК Возмещаемый,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Ссылка.Дата КАК Период,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ПричинаНевыхода КАК ПричинаНевыхода,
	//Паганини_
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Приход КАК Приход,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Уход КАК Уход,
	//_Паганини
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ВремяНачала КАК ВремяНачала,
	|	УчетРабочегоВремениСотрудниковПериодыВремени.ВремяОкончания КАК ВремяОкончания
	|ИЗ
	|	Документ.УчетРабочегоВремениСотрудников.ПериодыВремени КАК УчетРабочегоВремениСотрудниковПериодыВремени
	|ГДЕ
	|	УчетРабочегоВремениСотрудниковПериодыВремени.Ссылка = &Ссылка";
	
	ТаблицаУчетРабочегоВремениСотрудников = Запрос.Выполнить().Выгрузить();
	

	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетРабочегоВремениСотрудников", ТаблицаУчетРабочегоВремениСотрудников);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
